# CopyPasteOptions Class

---
Settings to control the behavior of a copy-paste operation.
SystemObject Autodesk.Revit.DBCopyPasteOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class CopyPasteOptions : IDisposable

    Public Class CopyPasteOptions
    	Implements IDisposable

    public ref class CopyPasteOptions : IDisposable

    type CopyPasteOptions =
        class
            interface IDisposable
        end
The CopyPasteOptions type exposes the following members.
| Name| Description
---|---|---
| CopyPasteOptions|  Creates a new instance of a CopyPasteOptions object.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the CopyPasteOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetDuplicateTypeNamesHandler|  Returns current duplicate type names handler or  if none is set.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetDuplicateTypeNamesHandler|  Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace